# SelectPluginCatalog

## Description
Brings up a dialog to select a catalog to attach to a plug-in style, change the attached catalog, or detach the current catalog.

```pascal
FUNCTION SelectPluginCatalog(hSymbol : HANDLE): BOOLEAN;
```

```python
def vs.SelectPluginCatalog(hSymbol):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSymbol|HANDLE|Handle to a symbol the defines a plug-in style.|

## Version
Availability: from Vectorworks 2018

## Category
* Objects - Custom